--liquibase formatted sql

--changeset alex:1
INSERT INTO event_type(name)
VALUES
('IT-секции'),
('Культурные'),
('Учебные'),
('Спортивные'),
('Социальные');

--changeset alex:2
insert into space_type (name)
values
('Актовый зал'),
('Кабинет'),
('Лаборатория'),
('Библиотека'),
('Спортзал'),
('Компьютерный класс'),
('Коворкинг'),
('Кафе'),
('Холл'),
('Аудитория');


-- Для здания 1
--changeset alex:3
insert into space (name, building_id, space_type_id)
values ('Актовый зал 1', 1, 1),
       ('Кабинет 101', 1, 2),
       ('Кабинет 102', 1, 2),
       ('Лаборатория физики', 1, 3),
       ('Библиотека', 1, 4),
       ('Спортзал', 1, 5),
       ('Компьютерный класс 1', 1, 6),
       ('Коворкинг', 1, 7),
       ('Кафе', 1, 8),
       ('Холл', 1, 9);

-- Для здания 2
--changeset alex:4
insert into space (name, building_id, space_type_id)
values
('Актовый зал 2', 2, 1),
('Кабинет 201', 2, 2),
('Кабинет 202', 2, 2),
('Лаборатория химии', 2, 3),
('Библиотека 2', 2, 4),
('Спортзал 2', 2, 5),
('Компьютерный класс 2', 2, 6),
('Аудитория 201', 2, 10),
('Кафе 2', 2, 8),
('Холл 2', 2, 9);
